import pandas as pd
import numpy as np

index_date = ['2018-10-07','2018-10-08','2018-10-09','2018-10-10']
s4 = pd.Series([200,195,np.nan,205],index = index_date)
print(s4)
'''
2018-10-07    200.0
2018-10-08    195.0
2018-10-09      NaN
2018-10-10    205.0
dtype: float64
'''

print(type(s4.index[0])) # <class 'str'>

# date_range 함수 이용한 날짜 생성
print(pd.date_range(start='2018-10-01', end='2018-10-20'))
print(pd.date_range(start='2018-10-01', end='2018-10-20', freq='d'))
# default day 기준으로 반환됨
'''
DatetimeIndex(['2018-10-01', '2018-10-02', '2018-10-03', '2018-10-04',
               '2018-10-05', '2018-10-06', '2018-10-07', '2018-10-08',
               '2018-10-09', '2018-10-10', '2018-10-11', '2018-10-12',
               '2018-10-13', '2018-10-14', '2018-10-15', '2018-10-16',
               '2018-10-17', '2018-10-18', '2018-10-19', '2018-10-20'],
              dtype='datetime64[ns]', freq='D')
'''

print(pd.date_range(start='2018-10-01', end='2018-10-20', freq='3D'))
# freq='3D' 3일씩 증가
'''
DatetimeIndex(['2018-10-01', '2018-10-04', '2018-10-07', '2018-10-10',
               '2018-10-13', '2018-10-16', '2018-10-19'],
              dtype='datetime64[ns]', freq='3D')
'''

print(pd.date_range(start='2018-10-01', end='2018-10-20', freq='w'))
# freq='w' 일주일씩 증가
# 1주 시작일 일요일부터 표시
# 2018년 10월 7일 - 일요일
'''
DatetimeIndex(['2018-10-07', '2018-10-14'], dtype='datetime64[ns]', freq='W-SUN')
'''

print(pd.date_range(start='2018-10-01', periods=4, freq='w'))
# periods=4, freq='w' : 2018년 10월 1일 이후 일요일 날짜 4개 생성
'''
DatetimeIndex(['2018-10-07', '2018-10-14', '2018-10-21', '2018-10-28'], dtype='datetime64[ns]', freq='W-SUN')
'''

print(pd.date_range(start='2018-10-01', periods=4, freq='m'))
# periods=4, freq='m' : 2018-10-01일 이후 월의 마지막 날짜 4개 생성
'''
DatetimeIndex(['2018-10-31', '2018-11-30', '2018-12-31', '2019-01-31'], dtype='datetime64[ns]', freq='M')
'''

print(pd.date_range(start='2018-10-01', periods=4, freq='MS'))
# periods=4, freq='m' : 2018-10-01일 이후 월의 시작 날짜 4개 생성
'''
DatetimeIndex(['2018-10-01', '2018-11-01', '2018-12-01', '2019-01-01'], dtype='datetime64[ns]', freq='MS')
'''

print(pd.date_range(start='2018-10-01', periods=12, freq='2BM'))
# '2BM' 업무일 기준 2개월 간격 월말 주기
'''
DatetimeIndex(['2018-10-31', '2018-12-31', '2019-02-28', '2019-04-30',
               '2019-06-28', '2019-08-30', '2019-10-31', '2019-12-31',
               '2020-02-28', '2020-04-30', '2020-06-30', '2020-08-31'],
              dtype='datetime64[ns]', freq='2BM')
'''

print(pd.date_range(start='2018-10-01', periods=4, freq='QS'))
# 분기 시작일 기준
'''
DatetimeIndex(['2018-10-01', '2019-01-01', '2019-04-01', '2019-07-01'], dtype='datetime64[ns]', freq='QS-JAN')
'''

print(pd.date_range(start='2018-10-01', periods=4, freq='AS'))
# 2018년 10월 1일 이후 연도 시작일 4개 생성
'''
DatetimeIndex(['2019-01-01', '2020-01-01', '2021-01-01', '2022-01-01'], dtype='datetime64[ns]', freq='AS-JAN')
'''

print(pd.date_range(start='2018-1-20 08:00', periods=10, freq='H'))
# 1시간 기준
'''
DatetimeIndex(['2018-01-20 08:00:00', '2018-01-20 09:00:00',
               '2018-01-20 10:00:00', '2018-01-20 11:00:00',
               '2018-01-20 12:00:00', '2018-01-20 13:00:00',
               '2018-01-20 14:00:00', '2018-01-20 15:00:00',
               '2018-01-20 16:00:00', '2018-01-20 17:00:00'],
              dtype='datetime64[ns]', freq='H')
'''

print(pd.date_range(start='2018-1-20 08:00', periods=10, freq='BH'))
# 업무시간 기준 9 to 5로 설정
'''
DatetimeIndex(['2018-01-22 09:00:00', '2018-01-22 10:00:00',
               '2018-01-22 11:00:00', '2018-01-22 12:00:00',
               '2018-01-22 13:00:00', '2018-01-22 14:00:00',
               '2018-01-22 15:00:00', '2018-01-22 16:00:00',
               '2018-01-23 09:00:00', '2018-01-23 10:00:00'],
              dtype='datetime64[ns]', freq='BH')
'''

print(pd.date_range(start='2018-1-20 08:00', periods=10, freq='30min'))
# 30분 기준
'''
DatetimeIndex(['2018-01-20 08:00:00', '2018-01-20 08:30:00',
               '2018-01-20 09:00:00', '2018-01-20 09:30:00',
               '2018-01-20 10:00:00', '2018-01-20 10:30:00',
               '2018-01-20 11:00:00', '2018-01-20 11:30:00',
               '2018-01-20 12:00:00', '2018-01-20 12:30:00'],
              dtype='datetime64[ns]', freq='30T')
'''

print(pd.date_range(start='2018-1-20 08:00', periods=10, freq='10S'))
# 10초 기준
'''
DatetimeIndex(['2018-01-20 08:00:00', '2018-01-20 08:00:10',
               '2018-01-20 08:00:20', '2018-01-20 08:00:30',
               '2018-01-20 08:00:40', '2018-01-20 08:00:50',
               '2018-01-20 08:01:00', '2018-01-20 08:01:10',
               '2018-01-20 08:01:20', '2018-01-20 08:01:30'],
              dtype='datetime64[ns]', freq='10S')
'''
