import pandas as pd
import numpy as np

'''
  행/열 삭제 - drop() 사용 예제
    - df.drop('행이름',0) : 행삭제
    - 행삭제 후 df로 결과를 반환
    - df.drop('행이름',1) : 열 삭제
    - 행삭제 후 df로 결과를 반환
    - 원본에 반영되지 않으므로 원본수정하려면 저장 해야 함 (inplace=True)    
'''
# 실습 데이터
np.random.seed(1)
df2=pd.DataFrame(np.random.randint(10,size=(4,8)))
df2['total']=df2.sum(axis=1)
df2.loc['max_data'] = df2[[0,1,2,3,4,5,6,7]].max(axis=0)
print(df2)
'''
             0    1    2    3    4    5    6    7  total
0         5.0  8.0  9.0  5.0  0.0  0.0  1.0  7.0   35.0
1         6.0  9.0  2.0  4.0  5.0  2.0  4.0  2.0   34.0
2         4.0  7.0  7.0  9.0  1.0  7.0  0.0  6.0   41.0
3         9.0  9.0  7.0  6.0  9.0  1.0  0.0  1.0   42.0
max_data  9.0  9.0  9.0  9.0  9.0  7.0  4.0  7.0    NaN
'''

# total 열 삭제
df2.drop('total',axis=1,inplace=True)
print(df2)
'''
            0    1    2    3    4    5    6    7
0         5.0  8.0  9.0  5.0  0.0  0.0  1.0  7.0
1         6.0  9.0  2.0  4.0  5.0  2.0  4.0  2.0
2         4.0  7.0  7.0  9.0  1.0  7.0  0.0  6.0
3         9.0  9.0  7.0  6.0  9.0  1.0  0.0  1.0
max_data  9.0  9.0  9.0  9.0  9.0  7.0  4.0  7.0
'''

# max_data 행 삭제
df2.drop('max_data', axis=0, inplace=True)
print(df2)
'''
     0    1    2    3    4    5    6    7
0  5.0  8.0  9.0  5.0  0.0  0.0  1.0  7.0
1  6.0  9.0  2.0  4.0  5.0  2.0  4.0  2.0
2  4.0  7.0  7.0  9.0  1.0  7.0  0.0  6.0
3  9.0  9.0  7.0  6.0  9.0  1.0  0.0  1.0
'''


