import pandas as pd
import numpy as np

'''
  df.dropna(axis=0/1)
    - NaN값이 있는 열 또는 행을 삭제
    - 원본 반영되지 않음
    - df.fillna(0)
    - NaN값을 정해진 숫자로 채움
    - 원본 반영 되지 않음
'''
# 실습 데이터
np.random.seed(1)
df2=pd.DataFrame(np.random.randint(10,size=(4,8)))
print(df2)
'''
     0    1    2    3    4    5    6    7
0  5.0  8.0  9.0  5.0  0.0  0.0  1.0  7.0
1  6.0  9.0  2.0  4.0  5.0  2.0  4.0  2.0
2  4.0  7.0  7.0  9.0  1.0  7.0  0.0  6.0
3  9.0  9.0  7.0  6.0  9.0  1.0  0.0  1.0
'''

# NaN값 생성
df2.iloc[0,0] = np.nan
print(df2)
'''
     0  1  2  3  4  5  6  7
0  NaN  8  9  5  0  0  1  7
1  6.0  9  2  4  5  2  4  2
2  4.0  7  7  9  1  7  0  6
3  9.0  9  7  6  9  1  0  1
'''

# NaN이 포함된 행을 삭제
print(df2.dropna(axis=0))
'''
     0  1  2  3  4  5  6  7
1  6.0  9  2  4  5  2  4  2
2  4.0  7  7  9  1  7  0  6
3  9.0  9  7  6  9  1  0  1
'''

# NaN이 포함된 열을 삭제
print(df2.dropna(axis=1))
'''
   1  2  3  4  5  6  7
0  8  9  5  0  0  1  7
1  9  2  4  5  2  4  2
2  7  7  9  1  7  0  6
3  9  7  6  9  1  0  1
'''

# 다시 NaN값 생성
df2.iloc[0,0] = np.nan
print(df2)
'''
     0  1  2  3  4  5  6  7
0  NaN  8  9  5  0  0  1  7
1  6.0  9  2  4  5  2  4  2
2  4.0  7  7  9  1  7  0  6
3  9.0  9  7  6  9  1  0  1
'''

# NaN값을 0으로 대체
print(df2.fillna(0))
'''
     0  1  2  3  4  5  6  7
0  0.0  8  9  5  0  0  1  7
1  6.0  9  2  4  5  2  4  2
2  4.0  7  7  9  1  7  0  6
3  9.0  9  7  6  9  1  0  1
'''

# 원본 반영하고 싶을 때 : inplace=True
df2.fillna(1,inplace=True)
print(df2)
'''
     0  1  2  3  4  5  6  7
0  1.0  8  9  5  0  0  1  7
1  6.0  9  2  4  5  2  4  2
2  4.0  7  7  9  1  7  0  6
3  9.0  9  7  6  9  1  0  1
'''

