import pandas as pd
import numpy as np

'''
  데이터프레임의 형변환
    - df.astype(자료형)
    - 전체 데이터에 대해서 형변환을 진행
'''
# 실습 데이터
np.random.seed(1)
df2=pd.DataFrame(np.random.randint(10,size=(4,8)))
df2.iloc[0,0]=np.nan
print(df2)
'''
     0  1  2  3  4  5  6  7
0  NaN  8  9  5  0  0  1  7
1  6.0  9  2  4  5  2  4  2
2  4.0  7  7  9  1  7  0  6
3  9.0  9  7  6  9  1  0  1
'''

# 결측치를 0으로 채우면서 df의 데이터를 정수형으로 형변환
print(df2.fillna(0).astype(int))
'''
   0  1  2  3  4  5  6  7
0  0  8  9  5  0  0  1  7
1  6  9  2  4  5  2  4  2
2  4  7  7  9  1  7  0  6
3  9  9  7  6  9  1  0  1
'''

# 결측치를 0으로 채우면서 df의 데이터를 실수형으로 형변환
print(df2.fillna(0).astype(float))
'''
     0    1    2    3    4    5    6    7
0  0.0  8.0  9.0  5.0  0.0  0.0  1.0  7.0
1  6.0  9.0  2.0  4.0  5.0  2.0  4.0  2.0
2  4.0  7.0  7.0  9.0  1.0  7.0  0.0  6.0
3  9.0  9.0  7.0  6.0  9.0  1.0  0.0  1.0
'''

